IDEA Open Model
Region3D.Outline Property
 Gets or sets the reference to PolyLine3D curve of Region3D.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public ReferenceElement Outline { get; set; }
Public Property Outline As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ Outline {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Region3D Class
IdeaRS.OpenModel.Geometry3D Namespace